-- Inserting values.
INSERT INTO EmployeeInfos
(FName, LName, MName, Phone, BirthDate)
VALUES
('Иван',	'Иванов',	'Иванович',		'(097) 123-12-12', '02/02/1990'),
('Петр',	'Петров',	'Петрович',		'(067) 345-78-90', '05/05/1983'),
('Андрей',	'Адреев',	'Андреевич',	'(050) 500-01-01', '12/12/1993'),
('Сергей',	'Сергеев',	'Сергеевич',	'(099) 310-11-99', '07/07/1995'),
('Алексей', 'Алексеев', 'Алексеевич',	'(066) 567-78-98', '03/03/1989')
GO

INSERT INTO PositionInfos
(Name, Salary)
VALUES
('Администратор',			15000),
('Инженер',					14000),
('Менеджер по контрактам',	13000),
('Менеджер по качеству',	13500),
('Менеджер по финансам',	14500)
GO

INSERT INTO ProjectInfos
(Name, CreatingDate, [State], Closingdate)
VALUES
('4Biosens',	'01/11/2019', 0, NULL),
('SmartShoes',	'02/25/2019', 0, NULL),
('Cindicator',	'01/14/2019', 0, NULL),
('Apis Cor',	'02/15/2019', 0, NULL),
('MixCart',		'01/31/2019', 1, '02/14/2019')
GO

INSERT INTO TaskList
(ProjectId, EmployeeId, PositionId)
VALUES
(1,				2,			 2),
(1,				2,			 3),
(2,				4,			 4),
(4,				5,			 3),
(2,				5,			 1),
(4,				2,			 5),
(3,				1,			 1),
(4,				5,			 4),
(2,				3,			 2),
(1,				1,			 3),
(4,				2,			 5),
(3,				1,			 1),
(4,				5,			 1),
(2,				3,			 2),
(1,				1,			 5)
GO

INSERT INTO TaskInfos
(TaskId, [Status], DateCheck, Deadline)
VALUES
(1,	 'open',			'02/02/2019', '02/09/2019'),
(2,	 'closed',			'02/07/2019', '02/08/2019'),
(3,	 'done',			'02/10/2019', '02/11/2019'),
(4,	 'open',			'01/31/2019', '02/07/2019'),
(5,	 'not done yet',	'02/01/2019', '01/31/2019'),
(6,	 'done',			'02/10/2019', '02/09/2019'),
(7,	 'closed',			'02/14/2019', '02/14/2019'),
(8,	 'open',			'02/17/2019', '02/26/2019'),
(9,  'open',			'02/18/2019', '02/27/2019'),
(10, 'not done yet',	'02/11/2019', '02/10/2019'),
(11, 'done',			'02/10/2019', '02/09/2019'),
(12, 'closed',			'02/14/2019', '02/16/2019'),
(13, 'open',			'02/17/2019', '02/25/2019'),
(14, 'open',			'02/18/2019', '02/25/2019'),
(15, 'not done yet',	'02/11/2019', '02/15/2019')
GO